import { Quote } from "./types";

export const QUOTES: Quote[] = [
  {
    author: "Савелий Тартаковер",
    quote: "Победа достается тому, кто сделал ошибку предпоследним",
  },
  {
    author: "Леонид Сухоруков",
    quote: "Шахматы - это тихая игра музыки разума",
  },
  {
    author: "Зигберт Тарраш",
    quote: "При правильной игре с обеих сторон ничья неизбежна",
  },
  {
    author: "Хабнер",
    quote: "Те, кто говорят, что понимают шахматы, ничего не понимают",
  },
  {
    author: "Стефан Цвейг",
    quote: "Шахматы — как и любовь — требуют партнера",
  },
  {
    author: "Ласкер",
    quote: "На шахматной доске ложь и коварство долго не живут",
  },
  {
    author: "Тартаковер",
    quote: "Всегда лучше жертвовать фигурами своего противника",
  },
  {
    author: "Ашот Наданян",
    quote: "Ягодичные мышцы — это то, что делает шахматы спортом",
  },
];

export const QUOTES_LENGTH = QUOTES.length;
